zelig5.org
#+TODO: TODO(t) STARTED(s) | DONE(d) CANCELED(c)

* Features
** TODO strata
** STARTED summarize
** STARTED Sphinx

* Documentation
** TODO Port model vignettes

* Zelig  5 Core models

** DONE ls.R
*** zelig
*** param
*** qi
** DONE logit.R
*** zelig
*** param
*** qi
** DONE probit.R
*** zelig
*** param
*** qi
** DONE exp.R
*** zelig
*** param
*** qi
** DONE gamma.R
*** zelig
*** param
*** qi
** DONE normal.R
*** zelig
*** param
*** qi
** STARTED poisson.R
*** zelig
*** param
*** qi
** STARTED lognorm.R
*** DONE zelig
*** DONE param
*** STARTED qi
**** DONE ev
**** TODO pv
** STARTED negbinom.R
*** zelig
*** param
*** qi
** STARTED relogit.R
*** zelig
*** param
*** qi
** STARTED tobit.R
*** zelig
*** param
*** qi


* Zelig 4 models (to be ported in Zelig 5.1 and Zelig 5.2)

** TODO gamma.survey.R
** TODO logit.survey.R
** TODO poisson.survey.R
** TODO normal.survey.R
** TODO probit.survey.R

** TODO logit.bayes.R
** TODO factor.bayes.R
** STARTED poisson.bayes.R
** TODO normal.bayes.R
** TODO mlogit.bayes.R
** TODO oprobit.bayes.R
** TODO probit.bayes.R

** TODO logit.gee.R
** TODO gamma.gee.R
** STARTED poisson.gee.R
** TODO normal.gee.R
** TODO probit.gee.R

** TODO twosls.R
   
