zelig5.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>zelig5</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="zelig5"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-06-08T12:39-0400"/>
<meta name="author" content="Christine Choirat"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">zelig5</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Features</a>
<ul>
<li><a href="#sec-1-1">1.1 strata</a></li>
<li><a href="#sec-1-2">1.2 summarize</a></li>
<li><a href="#sec-1-3">1.3 Sphinx</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Documentation</a>
<ul>
<li><a href="#sec-2-1">2.1 Port model vignettes</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Zelig  5 Core models</a>
<ul>
<li><a href="#sec-3-1">3.1 ls.R</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 zelig</a></li>
<li><a href="#sec-3-1-2">3.1.2 param</a></li>
<li><a href="#sec-3-1-3">3.1.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 logit.R</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 zelig</a></li>
<li><a href="#sec-3-2-2">3.2.2 param</a></li>
<li><a href="#sec-3-2-3">3.2.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 probit.R</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 zelig</a></li>
<li><a href="#sec-3-3-2">3.3.2 param</a></li>
<li><a href="#sec-3-3-3">3.3.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4 exp.R</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 zelig</a></li>
<li><a href="#sec-3-4-2">3.4.2 param</a></li>
<li><a href="#sec-3-4-3">3.4.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 gamma.R</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 zelig</a></li>
<li><a href="#sec-3-5-2">3.5.2 param</a></li>
<li><a href="#sec-3-5-3">3.5.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 normal.R</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1 zelig</a></li>
<li><a href="#sec-3-6-2">3.6.2 param</a></li>
<li><a href="#sec-3-6-3">3.6.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7 poisson.R</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1 zelig</a></li>
<li><a href="#sec-3-7-2">3.7.2 param</a></li>
<li><a href="#sec-3-7-3">3.7.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-8">3.8 lognorm.R</a>
<ul>
<li><a href="#sec-3-8-1">3.8.1 zelig</a></li>
<li><a href="#sec-3-8-2">3.8.2 param</a></li>
<li><a href="#sec-3-8-3">3.8.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-9">3.9 negbinom.R</a>
<ul>
<li><a href="#sec-3-9-1">3.9.1 zelig</a></li>
<li><a href="#sec-3-9-2">3.9.2 param</a></li>
<li><a href="#sec-3-9-3">3.9.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-10">3.10 relogit.R</a>
<ul>
<li><a href="#sec-3-10-1">3.10.1 zelig</a></li>
<li><a href="#sec-3-10-2">3.10.2 param</a></li>
<li><a href="#sec-3-10-3">3.10.3 qi</a></li>
</ul>
</li>
<li><a href="#sec-3-11">3.11 tobit.R</a>
<ul>
<li><a href="#sec-3-11-1">3.11.1 zelig</a></li>
<li><a href="#sec-3-11-2">3.11.2 param</a></li>
<li><a href="#sec-3-11-3">3.11.3 qi</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Zelig 4 models (to be ported in Zelig 5.1 and Zelig 5.2)</a>
<ul>
<li><a href="#sec-4-1">4.1 gamma.survey.R</a></li>
<li><a href="#sec-4-2">4.2 logit.survey.R</a></li>
<li><a href="#sec-4-3">4.3 poisson.survey.R</a></li>
<li><a href="#sec-4-4">4.4 normal.survey.R</a></li>
<li><a href="#sec-4-5">4.5 probit.survey.R</a></li>
<li><a href="#sec-4-6">4.6 logit.bayes.R</a></li>
<li><a href="#sec-4-7">4.7 factor.bayes.R</a></li>
<li><a href="#sec-4-8">4.8 poisson.bayes.R</a></li>
<li><a href="#sec-4-9">4.9 normal.bayes.R</a></li>
<li><a href="#sec-4-10">4.10 mlogit.bayes.R</a></li>
<li><a href="#sec-4-11">4.11 oprobit.bayes.R</a></li>
<li><a href="#sec-4-12">4.12 probit.bayes.R</a></li>
<li><a href="#sec-4-13">4.13 logit.gee.R</a></li>
<li><a href="#sec-4-14">4.14 gamma.gee.R</a></li>
<li><a href="#sec-4-15">4.15 poisson.gee.R</a></li>
<li><a href="#sec-4-16">4.16 normal.gee.R</a></li>
<li><a href="#sec-4-17">4.17 probit.gee.R</a></li>
<li><a href="#sec-4-18">4.18 twosls.R</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Features</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> strata</h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo STARTED">STARTED</span> summarize</h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo STARTED">STARTED</span> Sphinx</h3>
<div class="outline-text-3" id="text-1-3">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Documentation</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Port model vignettes</h3>
<div class="outline-text-3" id="text-2-1">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Zelig  5 Core models</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> ls.R</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-1-1">

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> param</h4>
<div class="outline-text-4" id="text-3-1-2">

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> qi</h4>
<div class="outline-text-4" id="text-3-1-3">

</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> logit.R</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-2-1">

</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> param</h4>
<div class="outline-text-4" id="text-3-2-2">

</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> qi</h4>
<div class="outline-text-4" id="text-3-2-3">

</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> probit.R</h3>
<div class="outline-text-3" id="text-3-3">


</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-3-1">

</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> param</h4>
<div class="outline-text-4" id="text-3-3-2">

</div>

</div>

<div id="outline-container-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> qi</h4>
<div class="outline-text-4" id="text-3-3-3">

</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> exp.R</h3>
<div class="outline-text-3" id="text-3-4">


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-4-1">

</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> param</h4>
<div class="outline-text-4" id="text-3-4-2">

</div>

</div>

<div id="outline-container-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> qi</h4>
<div class="outline-text-4" id="text-3-4-3">

</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> <span class="done DONE">DONE</span> gamma.R</h3>
<div class="outline-text-3" id="text-3-5">


</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-5-1">

</div>

</div>

<div id="outline-container-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> param</h4>
<div class="outline-text-4" id="text-3-5-2">

</div>

</div>

<div id="outline-container-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> qi</h4>
<div class="outline-text-4" id="text-3-5-3">

</div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="done DONE">DONE</span> normal.R</h3>
<div class="outline-text-3" id="text-3-6">


</div>

<div id="outline-container-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-6-1">

</div>

</div>

<div id="outline-container-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> param</h4>
<div class="outline-text-4" id="text-3-6-2">

</div>

</div>

<div id="outline-container-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> qi</h4>
<div class="outline-text-4" id="text-3-6-3">

</div>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="todo STARTED">STARTED</span> poisson.R</h3>
<div class="outline-text-3" id="text-3-7">


</div>

<div id="outline-container-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-7-1">

</div>

</div>

<div id="outline-container-3-7-2" class="outline-4">
<h4 id="sec-3-7-2"><span class="section-number-4">3.7.2</span> param</h4>
<div class="outline-text-4" id="text-3-7-2">

</div>

</div>

<div id="outline-container-3-7-3" class="outline-4">
<h4 id="sec-3-7-3"><span class="section-number-4">3.7.3</span> qi</h4>
<div class="outline-text-4" id="text-3-7-3">

</div>
</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> <span class="todo STARTED">STARTED</span> lognorm.R</h3>
<div class="outline-text-3" id="text-3-8">


</div>

<div id="outline-container-3-8-1" class="outline-4">
<h4 id="sec-3-8-1"><span class="section-number-4">3.8.1</span> <span class="done DONE">DONE</span> zelig</h4>
<div class="outline-text-4" id="text-3-8-1">

</div>

</div>

<div id="outline-container-3-8-2" class="outline-4">
<h4 id="sec-3-8-2"><span class="section-number-4">3.8.2</span> <span class="done DONE">DONE</span> param</h4>
<div class="outline-text-4" id="text-3-8-2">

</div>

</div>

<div id="outline-container-3-8-3" class="outline-4">
<h4 id="sec-3-8-3"><span class="section-number-4">3.8.3</span> <span class="todo STARTED">STARTED</span> qi</h4>
<div class="outline-text-4" id="text-3-8-3">

<ul>
<li id="sec-3-8-3-1"><span class="done DONE">DONE</span> ev<br/>
</li>
</ul>
<ul>
<li id="sec-3-8-3-2"><span class="todo TODO">TODO</span> pv<br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> <span class="todo STARTED">STARTED</span> negbinom.R</h3>
<div class="outline-text-3" id="text-3-9">


</div>

<div id="outline-container-3-9-1" class="outline-4">
<h4 id="sec-3-9-1"><span class="section-number-4">3.9.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-9-1">

</div>

</div>

<div id="outline-container-3-9-2" class="outline-4">
<h4 id="sec-3-9-2"><span class="section-number-4">3.9.2</span> param</h4>
<div class="outline-text-4" id="text-3-9-2">

</div>

</div>

<div id="outline-container-3-9-3" class="outline-4">
<h4 id="sec-3-9-3"><span class="section-number-4">3.9.3</span> qi</h4>
<div class="outline-text-4" id="text-3-9-3">

</div>
</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> <span class="todo STARTED">STARTED</span> relogit.R</h3>
<div class="outline-text-3" id="text-3-10">


</div>

<div id="outline-container-3-10-1" class="outline-4">
<h4 id="sec-3-10-1"><span class="section-number-4">3.10.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-10-1">

</div>

</div>

<div id="outline-container-3-10-2" class="outline-4">
<h4 id="sec-3-10-2"><span class="section-number-4">3.10.2</span> param</h4>
<div class="outline-text-4" id="text-3-10-2">

</div>

</div>

<div id="outline-container-3-10-3" class="outline-4">
<h4 id="sec-3-10-3"><span class="section-number-4">3.10.3</span> qi</h4>
<div class="outline-text-4" id="text-3-10-3">

</div>
</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> <span class="todo STARTED">STARTED</span> tobit.R</h3>
<div class="outline-text-3" id="text-3-11">


</div>

<div id="outline-container-3-11-1" class="outline-4">
<h4 id="sec-3-11-1"><span class="section-number-4">3.11.1</span> zelig</h4>
<div class="outline-text-4" id="text-3-11-1">

</div>

</div>

<div id="outline-container-3-11-2" class="outline-4">
<h4 id="sec-3-11-2"><span class="section-number-4">3.11.2</span> param</h4>
<div class="outline-text-4" id="text-3-11-2">

</div>

</div>

<div id="outline-container-3-11-3" class="outline-4">
<h4 id="sec-3-11-3"><span class="section-number-4">3.11.3</span> qi</h4>
<div class="outline-text-4" id="text-3-11-3">



</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Zelig 4 models (to be ported in Zelig 5.1 and Zelig 5.2)</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> gamma.survey.R</h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> logit.survey.R</h3>
<div class="outline-text-3" id="text-4-2">

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> poisson.survey.R</h3>
<div class="outline-text-3" id="text-4-3">

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> normal.survey.R</h3>
<div class="outline-text-3" id="text-4-4">

</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <span class="todo TODO">TODO</span> probit.survey.R</h3>
<div class="outline-text-3" id="text-4-5">


</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <span class="todo TODO">TODO</span> logit.bayes.R</h3>
<div class="outline-text-3" id="text-4-6">

</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> <span class="todo TODO">TODO</span> factor.bayes.R</h3>
<div class="outline-text-3" id="text-4-7">

</div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> <span class="todo STARTED">STARTED</span> poisson.bayes.R</h3>
<div class="outline-text-3" id="text-4-8">

</div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> <span class="todo TODO">TODO</span> normal.bayes.R</h3>
<div class="outline-text-3" id="text-4-9">

</div>

</div>

<div id="outline-container-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> <span class="todo TODO">TODO</span> mlogit.bayes.R</h3>
<div class="outline-text-3" id="text-4-10">

</div>

</div>

<div id="outline-container-4-11" class="outline-3">
<h3 id="sec-4-11"><span class="section-number-3">4.11</span> <span class="todo TODO">TODO</span> oprobit.bayes.R</h3>
<div class="outline-text-3" id="text-4-11">

</div>

</div>

<div id="outline-container-4-12" class="outline-3">
<h3 id="sec-4-12"><span class="section-number-3">4.12</span> <span class="todo TODO">TODO</span> probit.bayes.R</h3>
<div class="outline-text-3" id="text-4-12">


</div>

</div>

<div id="outline-container-4-13" class="outline-3">
<h3 id="sec-4-13"><span class="section-number-3">4.13</span> <span class="todo TODO">TODO</span> logit.gee.R</h3>
<div class="outline-text-3" id="text-4-13">

</div>

</div>

<div id="outline-container-4-14" class="outline-3">
<h3 id="sec-4-14"><span class="section-number-3">4.14</span> <span class="todo TODO">TODO</span> gamma.gee.R</h3>
<div class="outline-text-3" id="text-4-14">

</div>

</div>

<div id="outline-container-4-15" class="outline-3">
<h3 id="sec-4-15"><span class="section-number-3">4.15</span> <span class="todo STARTED">STARTED</span> poisson.gee.R</h3>
<div class="outline-text-3" id="text-4-15">

</div>

</div>

<div id="outline-container-4-16" class="outline-3">
<h3 id="sec-4-16"><span class="section-number-3">4.16</span> <span class="todo TODO">TODO</span> normal.gee.R</h3>
<div class="outline-text-3" id="text-4-16">

</div>

</div>

<div id="outline-container-4-17" class="outline-3">
<h3 id="sec-4-17"><span class="section-number-3">4.17</span> <span class="todo TODO">TODO</span> probit.gee.R</h3>
<div class="outline-text-3" id="text-4-17">


</div>

</div>

<div id="outline-container-4-18" class="outline-3">
<h3 id="sec-4-18"><span class="section-number-3">4.18</span> <span class="todo TODO">TODO</span> twosls.R</h3>
<div class="outline-text-3" id="text-4-18">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-06-08T12:39-0400</p>
<p class="author">Author: Christine Choirat</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
